backend: tensorflow
class_name: Model
config:
  input_layers:
  - - input_2
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - null
      - null
      - 1
      dtype: float32
      name: input_2
      sparse: false
    inbound_nodes: []
    name: input_2
  - class_name: ScalingLayer
    config:
      lower: 1000
      name: scaling_layer_2
      trainable: true
      upper: 5000
    inbound_nodes:
    - - - input_2
        - 0
        - 0
        - {}
    name: scaling_layer_2
  - class_name: DynamicPaddingLayer
    config:
      data_format: channels_last
      factor: 16
      name: dpad
      ndim: 4
      trainable: true
    inbound_nodes:
    - - - scaling_layer_2
        - 0
        - 0
        - {}
    name: dpad
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple
      - 1
      - 1
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: &id004 !!python/tuple
      - 1
      - 1
      name: c1x1_36
      padding: same
      strides: &id002 !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dpad
        - 0
        - 0
        - {}
    name: c1x1_36
  - class_name: Activation
    config:
      activation: relu
      name: relu_43
      trainable: true
    inbound_nodes:
    - - - c1x1_36
        - 0
        - 0
        - {}
    name: relu_43
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: &id005 !!python/tuple
      - 3
      - 3
      name: c3x3_15
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_43
        - 0
        - 0
        - {}
    name: c3x3_15
  - class_name: Activation
    config:
      activation: relu
      name: relu_44
      trainable: true
    inbound_nodes:
    - - - c3x3_15
        - 0
        - 0
        - {}
    name: relu_44
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: &id008 !!python/tuple
      - 1
      - 1
      name: c1x1_38
      padding: valid
      strides: &id009 !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dpad
        - 0
        - 0
        - {}
    name: c1x1_38
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: &id006 !!python/tuple
      - 1
      - 1
      name: c1x1_37
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_44
        - 0
        - 0
        - {}
    name: c1x1_37
  - class_name: Add
    config:
      name: add_15
      trainable: true
    inbound_nodes:
    - - - c1x1_38
        - 0
        - 0
        - &id003 {}
      - - c1x1_37
        - 0
        - 0
        - *id003
    name: add_15
  - class_name: Activation
    config:
      activation: relu
      name: relu_45
      trainable: true
    inbound_nodes:
    - - - add_15
        - 0
        - 0
        - {}
    name: relu_45
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id004
      name: c1x1_39
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_45
        - 0
        - 0
        - {}
    name: c1x1_39
  - class_name: Activation
    config:
      activation: relu
      name: relu_46
      trainable: true
    inbound_nodes:
    - - - c1x1_39
        - 0
        - 0
        - {}
    name: relu_46
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id005
      name: c3x3_16
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_46
        - 0
        - 0
        - {}
    name: c3x3_16
  - class_name: Activation
    config:
      activation: relu
      name: relu_47
      trainable: true
    inbound_nodes:
    - - - c3x3_16
        - 0
        - 0
        - {}
    name: relu_47
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id006
      name: c1x1_40
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_47
        - 0
        - 0
        - {}
    name: c1x1_40
  - class_name: Add
    config:
      name: add_16
      trainable: true
    inbound_nodes:
    - - - relu_45
        - 0
        - 0
        - &id007 {}
      - - c1x1_40
        - 0
        - 0
        - *id007
    name: add_16
  - class_name: Activation
    config:
      activation: relu
      name: relu_48
      trainable: true
    inbound_nodes:
    - - - add_16
        - 0
        - 0
        - {}
    name: relu_48
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: down2_4
      padding: valid
      pool_size: !!python/tuple
      - 2
      - 2
      strides: !!python/tuple
      - 2
      - 2
      trainable: true
    inbound_nodes:
    - - - relu_48
        - 0
        - 0
        - {}
    name: down2_4
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id004
      name: c1x1_41
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - down2_4
        - 0
        - 0
        - {}
    name: c1x1_41
  - class_name: Activation
    config:
      activation: relu
      name: relu_49
      trainable: true
    inbound_nodes:
    - - - c1x1_41
        - 0
        - 0
        - {}
    name: relu_49
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id005
      name: c3x3_17
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_49
        - 0
        - 0
        - {}
    name: c3x3_17
  - class_name: Activation
    config:
      activation: relu
      name: relu_50
      trainable: true
    inbound_nodes:
    - - - c3x3_17
        - 0
        - 0
        - {}
    name: relu_50
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id008
      name: c1x1_43
      padding: valid
      strides: *id009
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - down2_4
        - 0
        - 0
        - {}
    name: c1x1_43
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id006
      name: c1x1_42
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_50
        - 0
        - 0
        - {}
    name: c1x1_42
  - class_name: Add
    config:
      name: add_17
      trainable: true
    inbound_nodes:
    - - - c1x1_43
        - 0
        - 0
        - &id010 {}
      - - c1x1_42
        - 0
        - 0
        - *id010
    name: add_17
  - class_name: Activation
    config:
      activation: relu
      name: relu_51
      trainable: true
    inbound_nodes:
    - - - add_17
        - 0
        - 0
        - {}
    name: relu_51
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id004
      name: c1x1_44
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_51
        - 0
        - 0
        - {}
    name: c1x1_44
  - class_name: Activation
    config:
      activation: relu
      name: relu_52
      trainable: true
    inbound_nodes:
    - - - c1x1_44
        - 0
        - 0
        - {}
    name: relu_52
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id005
      name: c3x3_18
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_52
        - 0
        - 0
        - {}
    name: c3x3_18
  - class_name: Activation
    config:
      activation: relu
      name: relu_53
      trainable: true
    inbound_nodes:
    - - - c3x3_18
        - 0
        - 0
        - {}
    name: relu_53
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id006
      name: c1x1_45
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_53
        - 0
        - 0
        - {}
    name: c1x1_45
  - class_name: Add
    config:
      name: add_18
      trainable: true
    inbound_nodes:
    - - - relu_51
        - 0
        - 0
        - &id011 {}
      - - c1x1_45
        - 0
        - 0
        - *id011
    name: add_18
  - class_name: Activation
    config:
      activation: relu
      name: relu_54
      trainable: true
    inbound_nodes:
    - - - add_18
        - 0
        - 0
        - {}
    name: relu_54
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: down2_5
      padding: valid
      pool_size: !!python/tuple
      - 2
      - 2
      strides: !!python/tuple
      - 2
      - 2
      trainable: true
    inbound_nodes:
    - - - relu_54
        - 0
        - 0
        - {}
    name: down2_5
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id004
      name: c1x1_46
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - down2_5
        - 0
        - 0
        - {}
    name: c1x1_46
  - class_name: Activation
    config:
      activation: relu
      name: relu_55
      trainable: true
    inbound_nodes:
    - - - c1x1_46
        - 0
        - 0
        - {}
    name: relu_55
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id005
      name: c3x3_19
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_55
        - 0
        - 0
        - {}
    name: c3x3_19
  - class_name: Activation
    config:
      activation: relu
      name: relu_56
      trainable: true
    inbound_nodes:
    - - - c3x3_19
        - 0
        - 0
        - {}
    name: relu_56
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id008
      name: c1x1_48
      padding: valid
      strides: *id009
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - down2_5
        - 0
        - 0
        - {}
    name: c1x1_48
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id006
      name: c1x1_47
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_56
        - 0
        - 0
        - {}
    name: c1x1_47
  - class_name: Add
    config:
      name: add_19
      trainable: true
    inbound_nodes:
    - - - c1x1_48
        - 0
        - 0
        - &id012 {}
      - - c1x1_47
        - 0
        - 0
        - *id012
    name: add_19
  - class_name: Activation
    config:
      activation: relu
      name: relu_57
      trainable: true
    inbound_nodes:
    - - - add_19
        - 0
        - 0
        - {}
    name: relu_57
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id004
      name: c1x1_49
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_57
        - 0
        - 0
        - {}
    name: c1x1_49
  - class_name: Activation
    config:
      activation: relu
      name: relu_58
      trainable: true
    inbound_nodes:
    - - - c1x1_49
        - 0
        - 0
        - {}
    name: relu_58
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id005
      name: c3x3_20
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_58
        - 0
        - 0
        - {}
    name: c3x3_20
  - class_name: Activation
    config:
      activation: relu
      name: relu_59
      trainable: true
    inbound_nodes:
    - - - c3x3_20
        - 0
        - 0
        - {}
    name: relu_59
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id006
      name: c1x1_50
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_59
        - 0
        - 0
        - {}
    name: c1x1_50
  - class_name: Add
    config:
      name: add_20
      trainable: true
    inbound_nodes:
    - - - relu_57
        - 0
        - 0
        - &id013 {}
      - - c1x1_50
        - 0
        - 0
        - *id013
    name: add_20
  - class_name: Activation
    config:
      activation: relu
      name: relu_60
      trainable: true
    inbound_nodes:
    - - - add_20
        - 0
        - 0
        - {}
    name: relu_60
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: down2_6
      padding: valid
      pool_size: !!python/tuple
      - 2
      - 2
      strides: !!python/tuple
      - 2
      - 2
      trainable: true
    inbound_nodes:
    - - - relu_60
        - 0
        - 0
        - {}
    name: down2_6
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id004
      name: c1x1_51
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - down2_6
        - 0
        - 0
        - {}
    name: c1x1_51
  - class_name: Activation
    config:
      activation: relu
      name: relu_61
      trainable: true
    inbound_nodes:
    - - - c1x1_51
        - 0
        - 0
        - {}
    name: relu_61
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id005
      name: c3x3_21
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_61
        - 0
        - 0
        - {}
    name: c3x3_21
  - class_name: Activation
    config:
      activation: relu
      name: relu_62
      trainable: true
    inbound_nodes:
    - - - c3x3_21
        - 0
        - 0
        - {}
    name: relu_62
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id008
      name: c1x1_53
      padding: valid
      strides: *id009
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - down2_6
        - 0
        - 0
        - {}
    name: c1x1_53
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id006
      name: c1x1_52
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_62
        - 0
        - 0
        - {}
    name: c1x1_52
  - class_name: Add
    config:
      name: add_21
      trainable: true
    inbound_nodes:
    - - - c1x1_53
        - 0
        - 0
        - &id014 {}
      - - c1x1_52
        - 0
        - 0
        - *id014
    name: add_21
  - class_name: Activation
    config:
      activation: relu
      name: relu_63
      trainable: true
    inbound_nodes:
    - - - add_21
        - 0
        - 0
        - {}
    name: relu_63
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id004
      name: c1x1_54
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_63
        - 0
        - 0
        - {}
    name: c1x1_54
  - class_name: Activation
    config:
      activation: relu
      name: relu_64
      trainable: true
    inbound_nodes:
    - - - c1x1_54
        - 0
        - 0
        - {}
    name: relu_64
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id005
      name: c3x3_22
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_64
        - 0
        - 0
        - {}
    name: c3x3_22
  - class_name: Activation
    config:
      activation: relu
      name: relu_65
      trainable: true
    inbound_nodes:
    - - - c3x3_22
        - 0
        - 0
        - {}
    name: relu_65
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id006
      name: c1x1_55
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_65
        - 0
        - 0
        - {}
    name: c1x1_55
  - class_name: Add
    config:
      name: add_22
      trainable: true
    inbound_nodes:
    - - - relu_63
        - 0
        - 0
        - &id015 {}
      - - c1x1_55
        - 0
        - 0
        - *id015
    name: add_22
  - class_name: Activation
    config:
      activation: relu
      name: relu_66
      trainable: true
    inbound_nodes:
    - - - add_22
        - 0
        - 0
        - {}
    name: relu_66
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: down2_7
      padding: valid
      pool_size: !!python/tuple
      - 2
      - 2
      strides: !!python/tuple
      - 2
      - 2
      trainable: true
    inbound_nodes:
    - - - relu_66
        - 0
        - 0
        - {}
    name: down2_7
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id004
      name: c1x1_56
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - down2_7
        - 0
        - 0
        - {}
    name: c1x1_56
  - class_name: Activation
    config:
      activation: relu
      name: relu_67
      trainable: true
    inbound_nodes:
    - - - c1x1_56
        - 0
        - 0
        - {}
    name: relu_67
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id005
      name: c3x3_23
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_67
        - 0
        - 0
        - {}
    name: c3x3_23
  - class_name: Activation
    config:
      activation: relu
      name: relu_68
      trainable: true
    inbound_nodes:
    - - - c3x3_23
        - 0
        - 0
        - {}
    name: relu_68
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 1024
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id008
      name: c1x1_58
      padding: valid
      strides: *id009
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - down2_7
        - 0
        - 0
        - {}
    name: c1x1_58
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 1024
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id006
      name: c1x1_57
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_68
        - 0
        - 0
        - {}
    name: c1x1_57
  - class_name: Add
    config:
      name: add_23
      trainable: true
    inbound_nodes:
    - - - c1x1_58
        - 0
        - 0
        - &id016 {}
      - - c1x1_57
        - 0
        - 0
        - *id016
    name: add_23
  - class_name: Activation
    config:
      activation: relu
      name: relu_69
      trainable: true
    inbound_nodes:
    - - - add_23
        - 0
        - 0
        - {}
    name: relu_69
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id004
      name: c1x1_59
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_69
        - 0
        - 0
        - {}
    name: c1x1_59
  - class_name: Activation
    config:
      activation: relu
      name: relu_70
      trainable: true
    inbound_nodes:
    - - - c1x1_59
        - 0
        - 0
        - {}
    name: relu_70
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id005
      name: c3x3_24
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_70
        - 0
        - 0
        - {}
    name: c3x3_24
  - class_name: Activation
    config:
      activation: relu
      name: relu_71
      trainable: true
    inbound_nodes:
    - - - c3x3_24
        - 0
        - 0
        - {}
    name: relu_71
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 1024
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id006
      name: c1x1_60
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_71
        - 0
        - 0
        - {}
    name: c1x1_60
  - class_name: Add
    config:
      name: add_24
      trainable: true
    inbound_nodes:
    - - - relu_69
        - 0
        - 0
        - &id017 {}
      - - c1x1_60
        - 0
        - 0
        - *id017
    name: add_24
  - class_name: Activation
    config:
      activation: relu
      name: relu_72
      trainable: true
    inbound_nodes:
    - - - add_24
        - 0
        - 0
        - {}
    name: relu_72
  - class_name: UpSampling2D
    config:
      data_format: channels_last
      interpolation: nearest
      name: up2_4
      size: !!python/tuple
      - 2
      - 2
      trainable: true
    inbound_nodes:
    - - - relu_72
        - 0
        - 0
        - {}
    name: up2_4
  - class_name: Concatenate
    config:
      axis: -1
      name: concatenate_4
      trainable: true
    inbound_nodes:
    - - - up2_4
        - 0
        - 0
        - &id018 {}
      - - relu_66
        - 0
        - 0
        - *id018
    name: concatenate_4
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id004
      name: c1x1_61
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_4
        - 0
        - 0
        - {}
    name: c1x1_61
  - class_name: Activation
    config:
      activation: relu
      name: relu_73
      trainable: true
    inbound_nodes:
    - - - c1x1_61
        - 0
        - 0
        - {}
    name: relu_73
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id005
      name: c3x3_25
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_73
        - 0
        - 0
        - {}
    name: c3x3_25
  - class_name: Activation
    config:
      activation: relu
      name: relu_74
      trainable: true
    inbound_nodes:
    - - - c3x3_25
        - 0
        - 0
        - {}
    name: relu_74
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id008
      name: c1x1_63
      padding: valid
      strides: *id009
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_4
        - 0
        - 0
        - {}
    name: c1x1_63
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id006
      name: c1x1_62
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_74
        - 0
        - 0
        - {}
    name: c1x1_62
  - class_name: Add
    config:
      name: add_25
      trainable: true
    inbound_nodes:
    - - - c1x1_63
        - 0
        - 0
        - &id019 {}
      - - c1x1_62
        - 0
        - 0
        - *id019
    name: add_25
  - class_name: Activation
    config:
      activation: relu
      name: relu_75
      trainable: true
    inbound_nodes:
    - - - add_25
        - 0
        - 0
        - {}
    name: relu_75
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id004
      name: c1x1_64
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_75
        - 0
        - 0
        - {}
    name: c1x1_64
  - class_name: Activation
    config:
      activation: relu
      name: relu_76
      trainable: true
    inbound_nodes:
    - - - c1x1_64
        - 0
        - 0
        - {}
    name: relu_76
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id005
      name: c3x3_26
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_76
        - 0
        - 0
        - {}
    name: c3x3_26
  - class_name: Activation
    config:
      activation: relu
      name: relu_77
      trainable: true
    inbound_nodes:
    - - - c3x3_26
        - 0
        - 0
        - {}
    name: relu_77
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id006
      name: c1x1_65
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_77
        - 0
        - 0
        - {}
    name: c1x1_65
  - class_name: Add
    config:
      name: add_26
      trainable: true
    inbound_nodes:
    - - - relu_75
        - 0
        - 0
        - &id020 {}
      - - c1x1_65
        - 0
        - 0
        - *id020
    name: add_26
  - class_name: Activation
    config:
      activation: relu
      name: relu_78
      trainable: true
    inbound_nodes:
    - - - add_26
        - 0
        - 0
        - {}
    name: relu_78
  - class_name: UpSampling2D
    config:
      data_format: channels_last
      interpolation: nearest
      name: up2_5
      size: !!python/tuple
      - 2
      - 2
      trainable: true
    inbound_nodes:
    - - - relu_78
        - 0
        - 0
        - {}
    name: up2_5
  - class_name: Concatenate
    config:
      axis: -1
      name: concatenate_5
      trainable: true
    inbound_nodes:
    - - - up2_5
        - 0
        - 0
        - &id021 {}
      - - relu_60
        - 0
        - 0
        - *id021
    name: concatenate_5
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id004
      name: c1x1_66
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_5
        - 0
        - 0
        - {}
    name: c1x1_66
  - class_name: Activation
    config:
      activation: relu
      name: relu_79
      trainable: true
    inbound_nodes:
    - - - c1x1_66
        - 0
        - 0
        - {}
    name: relu_79
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id005
      name: c3x3_27
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_79
        - 0
        - 0
        - {}
    name: c3x3_27
  - class_name: Activation
    config:
      activation: relu
      name: relu_80
      trainable: true
    inbound_nodes:
    - - - c3x3_27
        - 0
        - 0
        - {}
    name: relu_80
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id008
      name: c1x1_68
      padding: valid
      strides: *id009
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_5
        - 0
        - 0
        - {}
    name: c1x1_68
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id006
      name: c1x1_67
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_80
        - 0
        - 0
        - {}
    name: c1x1_67
  - class_name: Add
    config:
      name: add_27
      trainable: true
    inbound_nodes:
    - - - c1x1_68
        - 0
        - 0
        - &id022 {}
      - - c1x1_67
        - 0
        - 0
        - *id022
    name: add_27
  - class_name: Activation
    config:
      activation: relu
      name: relu_81
      trainable: true
    inbound_nodes:
    - - - add_27
        - 0
        - 0
        - {}
    name: relu_81
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id004
      name: c1x1_69
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_81
        - 0
        - 0
        - {}
    name: c1x1_69
  - class_name: Activation
    config:
      activation: relu
      name: relu_82
      trainable: true
    inbound_nodes:
    - - - c1x1_69
        - 0
        - 0
        - {}
    name: relu_82
  - class_name: Conv2D
